app/views/authors/show.html.erb

<h1><%= @author.name %></h1>
  <% @author.books.each do |book| %>
---
SELECT "books".* FROM "books" INNER JOIN "book_authors" ON "books"."id" = "book_authors"."book_id" WHERE "book_authors"."author_id" = $1  [["author_id", 3]]

    <li><%= book.pub_year %></li>
      <% book.authors.each do |author| %>
---
SELECT "authors".* FROM "authors" INNER JOIN "book_authors" ON "authors"."id" = "book_authors"."author_id" WHERE "book_authors"."book_id" = $1  [["book_id", 3]]