app/views/books/index.html.erb

SELECT "authors".* FROM "authors" INNER JOIN "book_authors" ON "authors"."id" = "book_authors"."author_id" WHERE "book_authors"."book_id" = $1  [["book_id", 1]]
---

      <% book.authors.each do |author| %>