app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 69], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 69]]
---
  def destroy
    book = Book.find(params[:id])
    book.destroy

SELECT "authors".* FROM "authors"
SELECT "authors".* FROM "authors" WHERE "authors"."name" = $1  [["name", "2Pac"]]
---
  def create
    book_authors_array = book_params[:authors].split(', ')
    book = Book.find_by(title: book_params[:title].titleize)

    if book == nil
      if book_params[:thumb_url] == ""
        book = Book.new(title: book_params[:title], pages: book_params[:pages], pub_year:   book_params[:pub_year], thumb_url: "https://i.pinimg.com/236x/cd/d1/30/cdd130816adbd2e8b70c3ed6607fdb0c--clip-art.jpg")
      else
        book = Book.new(title: book_params[:title], pages: book_params[:pages], pub_year:   book_params[:pub_year], thumb_url: book_params[:thumb_url])
      end
    end

    new_author_array = []

    book_authors_array.each do |book_author|
      existing_author = Author.find_by(name: book_author)