app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."pages" DESC
---
  def index
    if params[:arg] == "highest_rated"
      @books = Book.highest_rated
    elsif params[:arg] == "lowest_rated"
      @books = Book.lowest_rated
    elsif params[:arg] == "ascending_pages"
      @books = Book.ascending_pages
    elsif params[:arg] == "descending_pages"
      @books = Book.descending_pages
    elsif params[:arg] == "descending_review_count"
      @books = Book.descending_review_count
    elsif params[:arg] == "ascending_review_count"
      @books = Book.ascending_review_count
    else
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."title" = $1 LIMIT $2  [["title", "Title"], ["LIMIT", 1]]
SELECT  "authors".* FROM "authors" WHERE "authors"."name" = $1 LIMIT $2  [["name", "#<Author::ActiveRecord_Associations_CollectionProxy:0x007f9fe56d6780>"], ["LIMIT", 1]]
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "#<Author::ActiveRecord_Associations_CollectionProxy:0x007f9fe56d6780>"], ["created_at", "2019-05-11 18:45:25.261446"], ["updated_at", "2019-05-11 18:45:25.261446"]]
INSERT INTO "books" ("title", "pages", "pub_year", "thumb_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", ""], ["pages", 123], ["pub_year", 1928], ["thumb_url", "hladsafjnsdo.jpg"], ["created_at", "2019-05-09 15:23:12.020180"], ["updated_at", "2019-05-09 15:23:12.020180"]]
---
  def create
    book_authors_array = book_params[:authors].split(', ')
    book = Book.find_by(title: book_params[:title].titleize)

    if book == nil
      if book_params[:thumb_url] == ""
        book = Book.new(title: book_params[:title], pages: book_params[:pages], pub_year:   book_params[:pub_year], thumb_url: "https://i.pinimg.com/236x/cd/d1/30/cdd130816adbd2e8b70c3ed6607fdb0c--clip-art.jpg")
      else
        book = Book.new(title: book_params[:title], pages: book_params[:pages], pub_year:   book_params[:pub_year], thumb_url: book_params[:thumb_url])
      end
    end

    new_author_array = []

    book_authors_array.each do |book_author|
      existing_author = Author.find_by(name: book_author)
      if existing_author != nil
        new_author_array << existing_author
      else
        new_author = Author.create(name: book_author)