app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user" = $1 ORDER BY "reviews"."created_at" DESC  [["user", "Brian Z."]]
---
  def index
    @reviews = Review.where(user: params[:name])

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @book = Book.find(params[:book_id])

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user" = $1  [["user", "Mill"]]
INSERT INTO "reviews" ("score", "heading", "full_review", "book_id", "created_at", "updated_at", "user") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @book = Book.find(params[:book_id])
    if Review.where(user: review_params[:user].titleize) == []
      @review = @book.reviews.create(review_params)

DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]
---
  def destroy
    Review.destroy(params[:id])